Tekla Open API Reference for Tekla Structures 2025
TransformationPlane Constructor
 Creates a new identity transformation using the global coordinate system.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public TransformationPlane()
Public Sub New
See Also
Reference
TransformationPlane Class
TransformationPlane Overload
Tekla.Structures.Model Namespace